Repository: quoideneuf/sword
Catalog: locale/*/locale.po
Languages: fr_ca, pt_br, pt_pt, ru_ru

# plugins.generic.sword.displayName
source: SWORD Plugin
fr_ca: Plugiciel SWORD
pt_br: Protocolo SWORD
pt_pt: Plugin SWORD
ru_ru: Плагин «SWORD»

# plugins.generic.sword.description
source: Allow Journal Managers and (optionally) Authors to deposit articles via the SWORD protocol
fr_ca: Permet aux directeurs et directrices ainsi (optionnellement) qu'aux auteurs et auteures de la revue de déposer des articles par l'intermédiaire du protocole SWORD
pt_br: Permite editores-gerentes e (opcionalmente) a autores depositar artigos por meio do protocolo SWORD.
pt_pt: Permite aos Editores de Revistas e (opcionalmente) Autores depositar artigos via protocolo SWORD
ru_ru: Этот плагин позволяет управляющим журналами и (при необходимости) авторам передавать на хранение статьи по протоколу SWORD

# plugins.generic.sword.enabled
source: The SWORD plugin has been enabled.
fr_ca: Le plugiciel SWORD a été activé.
pt_br: O plugin SWORD foi habilitado.
pt_pt: O plugin SWORD foi activado
ru_ru: Плагин «SWORD» был включен.

# plugins.generic.sword.settings
source: Settings
fr_ca: Paramètres
pt_br: Configurações
pt_pt: Configurações
ru_ru: Настройки

# plugins.generic.sword.settings.allowAuthorSpecify
source: Allow the author to specify a deposit point
fr_ca: Permet à l'auteur ou l'auteure de spécifier un point de dépôt
pt_br: Permitir ao autor especificar um ponto de depósito
pt_pt: Permitir ao autor especificar um ponto de depósito
ru_ru: Разрешить авторам задавать точку хранения

# plugins.generic.sword.settings.depositPoints
source: Deposit Points
fr_ca: Points de dépôt
pt_br: Pontos de depósito
pt_pt: Pontos de Depósito
ru_ru: Точки хранения

# plugins.generic.sword.depositPoints.create
source: Create Deposit Point
fr_ca: Créer un point de dépôt
pt_br: Criar ponto de depósito
pt_pt: Criar Ponto de Depósito
ru_ru: Создать точку хранения

# plugins.generic.sword.depositPoints.edit
source: Edit Deposit Point
fr_ca: Modifier un point de dépôt
pt_br: Editar ponto de depósito
pt_pt: Editar Ponto de Depósito
ru_ru: Редактировать точку хранения

# plugins.generic.sword.depositPoints.type.automatic
source: Automatic
fr_ca: Automatique
pt_br: Automático
pt_pt: Automático
ru_ru: Автоматическая

# plugins.generic.sword.depositPoints.type.optionalSelection
source: Optional; Flexible
fr_ca: Optionnel ; flexible
pt_br: Opcional; Flexível
pt_pt: Opcional; Flexivel
ru_ru: По желанию (гибкая)

# plugins.generic.sword.depositPoints.type.optionalFixed
source: Optional; Fixed
fr_ca: Optionnel ; fixé
pt_br: Opcional; Fixo
pt_pt: Opcional; Fixo
ru_ru: По желанию (фиксированная)

# plugins.generic.sword.depositPoints.type.manager
source: Manager Only
fr_ca: Directeur-trice uniquement
pt_br: Apenas gerentes
pt_pt: Somente Editor-Gestor
ru_ru: Только управляющий

# plugins.generic.sword.depositPoints.type.description
source: <h4>Deposit Point Types:</h4> <p><strong>Automatic</strong>: The deposit occurs automatically. The full SWORD deposit point is specified. A username and password must be specified. Deposit occurs after notifying the author of acceptance.<br/> <strong>Optional; Flexible</strong>: The author can choose whether or not to deposit. The specified URL indicates a service document, and the author may choose which specific deposit point to use from that document. Deposit occurs after notifying the author of acceptance.<br/> <strong>Optional; Fixed</strong>: The author can choose whether or not to deposit. The URL specifies the specific SWORD deposit point. Deposit occurs after notifying the author of acceptance.<br/> <strong>Manager Only</strong>: Only the Journal Manager may use this deposit point. The URL indicates a service document. Deposit is manually performed by the Journal Manager using the Import/Export interface in Journal Management. </p>
fr_ca: <h4>Types de point de dépôt :</h4> <p><strong>Automatique</strong> : le dépôt survient automatiquement. Le point de dépôt SWORD est spécifié intégralement. Un nom d'utilisateur-trice et un mot de passe doit être spécifié. Le dépôt survient après avoir aviser l'auteur-e de son acceptation.<br/> <strong>Optionnel ; flexible</strong> : l'auteur-e peut choisir ou non d'effectuer un dépôt. L'URL spécifiée indique un document de service, et l'auteur-e peut choisir quel point de dépôt spécifique utiliser à partir de ce document. Le dépôt survient après avoir avisé l'auteur-e de son acceptation.<br/> <strong>Optionnel ; fixé</strong> : l'auteur-e peut choisir ou non d'effectuer un dépôt. L'URL spécifie le point de dépôt SWORD spécifique. Le dépôt survient après avoir avisé l'auteur-e de son acceptation.<br/> <strong>Directeur-trice uniquement</strong> : seul le,la directeur-trice de la revue peut utiliser ce point de dépôt. L'URL indique un document de service. Le dépôt est effectué manuellement par le,la directeur-trice de la revue en utilisant l'interface « Importer/Exporter » dans « Gestion de la revue ». </p>
pt_br: <h4>Tipos de pontos de depósito:</h4> <p><strong>Automático</strong>: O depósito ocorre de forma automática. Um ponto de depósito SWORD completo é especificado. Um login e e uma senha devem ser definidos. O depósito ocorre após notificação de aceitação ao autor.<br/> <strong>Opcional; Flexível</strong>: O autor pode escolher entre depositar ou não. A URL especificada indica um documento de serviço, e o autor pode escolher qual ponto de depósito específico usar a partir desse documento. O depósito ocorre após notificação de aceitação ao autor.<br/> <strong>Opcional; Fixo</strong>: O autor pode escolher entre depositar ou não. A URL informada indica um ponto SWORD específico. O depósito ocorre após notificação de aceitação ao autor.<br/> <strong>Apenas gerentes</strong>: Apenas o editor gerente pode usar este ponto de depósito. A URL especificada indica um documento de serviço. O depósito é realizado manualmente pelo editor gerente por meio da interface de Importação/Exportação na administração da revista. </p>
pt_pt: <h4>Tipos de Pontos de Depósito:</h4> <p><strong>Automatic</strong>: O depósito ocorrer automaticamente. O ponto de depósito SWORD é especificado. Tem de ser indicado um nome de utilizador e senha. O depósito ocorre após notificação do autor sobre a aceitação.<br/> <strong>Opcional; Flexível</strong>: O autor pode escolher se pretende depositar ou não. O URL especificado indica um serviço documental, e o autor pode escolher choose qual o ponto específico do depósito a ser usado do documento. O depósito ocorre após notificação do autor sobre a aceitação.<br/> <strong>Opcional; Fixo</strong>: O autor pode escolher se pretende depositar ou não. O URL indica o específico ponto de depósito SWORD. O depósito ocorre após notificação do autor sobre a aceitação.<br/> <strong>Somente Editor-Gestor</strong>: Apenas o Editor-Gestor pode usar este ponto de depósito. O URL indica um serviço documental. O depósito é manualmente operado pelo Editor-Gestor usando a interface Importar/Exportar da Administração da Revista. </p>
ru_ru: <h4>Типы точек хранения:</h4> <p><strong>Автоматическая</strong>: Передача на хранение производится автоматически. Указывается полная точка хранения SWORD. Должны быть указаны имя пользователя и пароль. Передача на хранение происходит после уведомления автора о приеме материала к публикации.<br/> <strong>По желанию (гибкая)</strong>: Автор может выбрать передавать на хранение или нет. Заданный адрес (URL) показывает служебный документ и автор может выбрать из этого документа, какую точку хранения использовать. Передача на хранение происходит после уведомления автора о приеме материала к публикации.<br/> <strong>По желанию (фиксированная)</strong>: Автор может выбрать передавать на хранение или нет. Адрес (URL) задает конкретную точку хранения SWORD. Передача на хранение происходит после уведомления автора о приеме материала к публикации.<br/> <strong>Только управляющий</strong>: Эту точку хранения может использовать только управляющий журналом. Адрес (URL) показывает служебный документ. Передача на хранение выполняется вручную управляющим журнала, используя интерфейс импорта/экспорта в разделе «Управление журналом». </p>

# plugins.generic.sword.depositPoints.password.description
source: If you do not specify a password here, you and/or the author will be prompted for one when the deposit occurs. Note that this password will be visible to all Journal Managers and will be stored unencrypted in the database.
fr_ca: Si vous ne spécifiez pas un mot de passe ici, vous et/ou l'auteur-e sera-ez invité-e-s à en spécifier un quand le dépôt surviendra. À noter que ce mot de passe sera visible à tous les directeurs-trices de revue et sera stocké de manière non encryptée dans la base de données.
pt_br: Caso não especifique uma senha aqui, será solicitada uma senha a você e/ou ao autor quando ocorrer o depósito. Note que esta senha será visível a todos os editores-gerentes, e será armazenada sem criptografia de segurança na base de dados.
pt_pt: Se não especificar uma senha aqui, você e/ou o autor serão interpelados novamente quando ocorrer o depósito. Note que esta senha será vísivel a todos os Editores-Gestor e será armazenada sem qualquer encripetação na base de dados.
ru_ru: Если вы не укажите здесь пароль, вы и/или автор получат сообщение с просьбой ввести его при передача на хранение. Обратите внимание, что этот пароль будет видим для всех управляющих журналами и будет храниться в незашифрованном виде в базе данных.

# plugins.generic.sword.depositPoints.name
source: Name
fr_ca: Nom
pt_br: Título
pt_pt: Nome
ru_ru: Название

# plugins.generic.sword.automaticDepositComplete
source: The item "{$itemTitle}" was automatically deposited into the repository "{$repositoryName}".
fr_ca: L' élément « {$itemTitle} » a été automatiquement déposé dans le dépôt « {$repositoryName} ».
pt_br: O item "{$itemTitle}" foi automaticamente depositado no repositório "{$repositoryName}".
pt_pt: O item "{$itemTitle}" foi automaticamente depositado no repositório "{$repositoryName}".
ru_ru: Материал «{$itemTitle}» был автоматически передан на хранение в репозиторий «{$repositoryName}».

# plugins.generic.sword.depositComplete
source: The item "{$itemTitle}" was deposited into the repository "{$repositoryName}".
fr_ca: L' élément « {$itemTitle} » a été déposé dans le dépôt « {$repositoryName} ».
pt_br: O item "{$itemTitle}" foi depositado no repositorio "{$repositoryName}".
pt_pt: O item "{$itemTitle}" foi depositado no repositório "{$repositoryName}".
ru_ru: Материал «{$itemTitle}» был передан на хранение в репозиторий «{$repositoryName}».

# plugins.generic.sword.authorDepositDescription
source: <p>You may optionally use the following form to deposit your submission, "{$submissionTitle}", in one of the repositories listed. Use the checkboxes down the left-hand column to select which repositories you wish to deposit your submission into; each repository may also allow you to specify a deposit point from a pull-down list.</p>
fr_ca: <p>Vous pouvez optionnellement utiliser le formulaire suivant pour déposer votre soumission, « {$submissionTitle} », dans l'un des dépôts listés. Utiliser les boîtes à cocher en bas de la colonne de gauche pour sélectionner dans quels dépôt vous souhaitez déposer votre soumission ; chaque dépôt peut également vous permettre de spécifier un point de dépôt à partir d'une liste déroulante.</p>
pt_br: <p>Use o formulário a seguir como opção para depositar sua submissão, "{$submissionTitle}", em um dos repositórios listados. Use as caixas de seleção na coluna esquerda para escolher em quais repositórios deseja depositar sua submissão; cada repositório pode permitir especificar um ponto de depósito a partir do menu dropdown.</p>
pt_pt: <p>Por opção pode usar o seguinte formulário para depositar a sua submissão, "{$submissionTitle}", num dos repositórios listado. Use as checkboxes em baixo na coluna à esquerda em ordem a seleccionar para qual dos repositórios pretende depositar a sua submissão; cada repositório permite também especificar um ponto de depósito point a partir de uma lista descendente.</p>
ru_ru: <p>При необходимости вы можете использовать следующую форму для передачи вашего материала «{$submissionTitle}» в один из перечисленных репозиториев. Используйте галочки в левой колонке для выбора тех репозиториев, в которые вы хотите передать вашу статью; каждый репозиторий может также дать вам возможность указать точку хранения, выбрав ее из раскрывающегося списка.</p>

# plugins.generic.sword.authorCustomDepositDescription
source: <p>You may optionally specify a SWORD-compliant deposit point in the following form. If desired, please specify a SWORD URL, username and password to your repository and the submission will be deposited.</p>
fr_ca: <p>Vous pouvez optionnellement spécifier un point de dépôt SWORD-compatible dans le formulaire suivant. Si désiré, veuillez spécifier un URL, nom d'utilisateur et mot de passe SWORD vers votre dépôt et votre soumission sera déposée.</p>
pt_br: <p>Informe, opcionalmente, um ponto de depósito SWORD específico no formulário a seguir. Caso deseje, informe a URL SWORD, login e senha para o repositório e a submissão será depositada.</p>
pt_pt: <p>Por opção pode especificar um ponto de depósito SWORD-compliant no seguinte formulário. Se assim o desejar, indique um URL SWORD, nome de utilizador e senha para o seu repositório e a submissão será depositada.</p>
ru_ru: <p>При необходимости вы можете указать в следующей форме SWORD-совместимую точку хранения. Если хотите, пожалуйста, укажите адрес (URL) SWORD, имя пользователя и пароль для вашего репозитория и материал будет передан туда на хранение.</p>

# plugins.importexport.sword.displayName
source: SWORD Import/Export Deposit Plugin
fr_ca: Plugiciel de dépôt Importer/Exporter SWORD
pt_br: Plugin SWORD para importação/exportação e depósito
pt_pt: Importar/Exportar Plugin Depósito SWORD
ru_ru: Плагин «Передача на хранение SWORD: Импорт/Экспорт»

# plugins.importexport.sword.description
source: Deposit articles in remote repositories using the SWORD deposit protocol
fr_ca: Déposer des articles dans des dépôts distants en utilisant le protocole de dépôt SWORD
pt_br: Depositar artigos em repositórios remotos usando o protocolo de depósito SWORD.
pt_pt: Artigos do depósito nos repositórios remotos usando o protocolo de depósito SWORD
ru_ru: Этот плагин передает статьи на хранение в удаленные репозитории по протоколу передачи на хранение SWORD

# plugins.importexport.sword.deposit
source: Deposit
fr_ca: Dépôt
pt_br: Depositar
pt_pt: Depósito
ru_ru: Передать на хранение

# plugins.importexport.sword.serviceDocUrl
source: Service Document URL
fr_ca: URL du document de service
pt_br: URL do documento de serviço
pt_pt: URL Serviço Documental
ru_ru: Адрес (URL) служебного документа

# plugins.importexport.sword.depositUrl
source: Deposit Point URL
fr_ca: URL de point de dépôt
pt_br: URL do ponto de depósito
pt_pt: URL Ponto Depósito
ru_ru: Адрес (URL) точки хранения

# plugins.importexport.sword.depositPoint
source: Deposit Point
fr_ca: Point de dépôt
pt_br: Pontos de depósito
pt_pt: Ponto Depósito
ru_ru: Точка хранения

# plugins.importexport.sword.depositPoint.addRemove
source: Add/Remove
fr_ca: Ajouter/Supprimer
pt_br: Incluir/excluir
pt_pt: Adicionar/Remover
ru_ru: Добавить/удалить

# plugins.importexport.sword.depositGalleys
source: Deposit Galleys
fr_ca: Déposer les épreuves
pt_br: Depositar composições
pt_pt: Galerias dos Depósitos
ru_ru: Передать на хранение гранки

# plugins.importexport.sword.depositEditorial
source: Deposit Most Recent Editorial File
fr_ca: Déposer le plus fichier éditorial le plus récent
pt_br: Depositar arquivo editorial mais recente
pt_pt: Depositar o Ficheiro Editorial mais Recente
ru_ru: Передать самый свежий редакционный файл

# plugins.importexport.sword.depositSuccessful
source: Deposit Successful
fr_ca: Dépôt réussi
pt_br: Depósito realizado com sucesso
pt_pt: Depósito com Sucesso
ru_ru: Передача на хранение: успешно

# plugins.importexport.sword.depositSuccessfulDescription
source: The item(s) selected have been deposited.
fr_ca: Le(s) élément(s) sélectionné(s) a(ont) été déposé(s).
pt_br: Os itens escolhidos foram depositados.
pt_pt: O(s) item(s) seleccionados foram depositados.
ru_ru: Выбранные элементы были переданы на хранение.

# plugins.importexport.sword.depositFailed
source: Deposit Failed
fr_ca: Le dépôt a échoué
pt_br: Falha no depósito
pt_pt: Depósito Falhou
ru_ru: Передача на хранение: неудача

# plugins.generic.sword.descriptionUnsupported
source: Allow Journal Managers and (optionally) Authors to deposit articles via the SWORD protocol. Note that this plugin requires the Zip extension, which is currently NOT installed.
fr_ca: Permet aux directeurs et directrices ainsi (optionnellement) qu'aux auteurs et auteures de la revue de déposer des articles par l'intermédiaire du protocole SWORD. Veuillez noter que ce plugiciel requiert l'extension ZIP, laquelle n'est PAS installée actuellement.
pt_br: Permitir que Editores Gerentes e (opcionalmente) Autores depositem artigos através do protocolo SWORD. Note-se que este plugin requer a extensão Zip, que no momento não está instalado.
pt_pt: Permitir Directores de Revista e (opcionalmente) Autores depositar artigos através do protocolo SWORD. Note-se que este plugin requer a extensão Zip, que actualmente não está instalado no sistema.
ru_ru: Этот плагин позволяет управляющим журналами и (при необходимости) авторам передавать на хранение статьи по протоколу SWORD. Обратите внимание, что этот плагин требует PHP-расширения Zip, которое сейчас НЕ установлено.

# plugins.generic.sword.formErrors.apikey
source: Api key required unless username and password are present.
fr_ca: Une clé API est requise sauf si le nom d'utilisateur-trice et le mot de passe sont présents.
ru_ru: Требуется ключ API пока не будут введены имя пользователя и пароль.

# plugins.generic.sword.formErrors.password
source: Password required if username is present or api key is empty.
fr_ca: Un mot de passe est requis si le nom d'utilisateur-trice est présent ou encore que la clé API est vide.
ru_ru: Требуется пароль если имя пользователя введено или ключ API не введен.

# plugins.generic.sword.formErrors.username
source: Username required if password is present or api key is empty.
fr_ca: Un nom d'utilisateur-trice est requis si le mot de passe est présent ou encore que la clé API est vide.
ru_ru: Требуется имя пользователя если есть пароль или ключ API не введен.

# plugins.generic.sword.manager.noneCreated
source: No deposit points have been created.
fr_ca: Aucun point de dépôt n'a été créé.
ru_ru: Не было создано точек хранения.

# plugins.generic.sword.settings.saved
source: Settings saved!
fr_ca: Paramètres sauvegardés !
ru_ru: Настройки сохранены!

# plugins.importexport.sword.requiredFieldErrorMessage
source: Please select at least one submission to deposit.
fr_ca: Veuillez sélectionner au moins une soumission à déposer.
ru_ru: Выберите хотя бы один материал (подачу) для размещения.

# plugins.importexport.sword.requiredFieldErrorTitle
source: Submission required
fr_ca: Soumission requise
ru_ru: Требуется материал (подача)

# plugins.importexport.sword.apikey
source: API Key
fr_ca: Clé API
ru_ru: Ключ API

# plugins.generic.sword.depositPoints.apikey
source: API Key
fr_ca: Clé API
ru_ru: Ключ API
